app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)

    respond_to do |format|
      if @article.save
---
INSERT INTO "articles" ("body", "created_at", "title", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["body", "zeoprjzeopirjezrezoprzkprkezoprkzp"], ["created_at", Sun, 02 Mar 2014 20:53:42 UTC +00:00], ["title", "Lola"], ["updated_at", Sun, 02 Mar 2014 20:53:42 UTC +00:00]]